That seemed to have worked 👍 

I can also use it in my virtual server call:
```
resource "bigip_ltm_virtual_address" "advertrize_route" {
  name            = "/Common/10.10.10.10"
  advertize_route = "selective"
  icmp_echo       = "enabled"
}

resource "bigip_ltm_virtual_server" "vip" {
  name                 = "/Common/test"
  destination          = bigip_ltm_virtual_address.advertrize_route.name
  description          = "test"
  port                 = 900
}
```

```
terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # bigip_ltm_virtual_address.advertrize_route will be created
  + resource "bigip_ltm_virtual_address" "advertrize_route" {
      + advertize_route = "selective"
      + arp             = true
      + auto_delete     = true
      + conn_limit      = 0
      + enabled         = true
      + icmp_echo       = "enabled"
      + id              = (known after apply)
      + name            = "/Common/10.10.10.10"
      + traffic_group   = "/Common/traffic-group-1"
    }

  # bigip_ltm_virtual_server.vip will be created
  + resource "bigip_ltm_virtual_server" "vip" {
      + client_profiles              = (known after apply)
      + description                  = "test"
      + destination                  = "/Common/10.10.10.10"
      + fallback_persistence_profile = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = (known after apply)
      + mask                         = (known after apply)
      + name                         = "/Common/test"
      + port                         = 900
      + profiles                     = (known after apply)
      + server_profiles              = (known after apply)
      + snatpool                     = (known after apply)
      + source                       = (known after apply)
      + source_address_translation   = (known after apply)
      + state                        = "enabled"
      + translate_address            = (known after apply)
      + translate_port               = (known after apply)
      + vlans_enabled                = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

bigip_ltm_virtual_address.advertrize_route: Creating...
bigip_ltm_virtual_address.advertrize_route: Creation complete after 1s [id=/Common/10.10.10.10]
bigip_ltm_virtual_server.vip: Creating...
bigip_ltm_virtual_server.vip: Creation complete after 2s [id=/Common/test]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```

We might have to update the documentation and can close this issue :)